In [5]:
import pandas as pd
pop = pd.Series([9904312,3448737,2890451,2466052], index = ['서울', '부산', '인천', '대구'])
pop

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [7]:
dic = {"서울":9631482, "부산":3393191, "인천": 2632035, "대전": 1490158 }
dic

{'서울': 9631482, '부산': 3393191, '인천': 2632035, '대전': 1490158}

In [8]:
pop1 = pd.Series(dic)
pop1

서울    9631482
부산    3393191
인천    2632035
대전    1490158
dtype: int64

In [9]:
result = pop - pop1
result

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [11]:
result.notnull()
result[result.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [12]:
pop['대구']=2001234
pop

서울    9904312
부산    3448737
인천    2890451
대구    2001234
dtype: int64

In [13]:
del pop['대구']
pop

서울    9904312
부산    3448737
인천    2890451
dtype: int64

In [14]:
data = {
    "2015" : [9904312,3448737,2890451,2466052],
    "2010" : [9631482,3393191,2632035,2431774]
}
df = pd.DataFrame(data)
df

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035
3  2466052  2431774

In [15]:
bol = df['2015']>=2500000
df[bol]

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035

In [19]:
df.loc[df.loc[:, '2015'] >= 2500000]

      2015     2010
0  9904312  9631482
1  3448737  3393191
2  2890451  2632035

In [20]:
data = [[9904312,3448737,2890451,2466052],[9361482,3393191,2632035,243174]]
ind = ['2015', '2010']
col = ['서울', '부산', '인천', '대구']

df2 = pd.DataFrame(data, index = ind, columns = col)
df2

           서울       부산       인천       대구
2015  9904312  3448737  2890451  2466052
2010  9361482  3393191  2632035   243174

In [22]:
df2.index

Index(['2015', '2010'], dtype='object')

In [24]:
df2.columns

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [25]:
df2['서울']=[9900000, 9300000]
df2

           서울       부산       인천       대구
2015  9900000  3448737  2890451  2466052
2010  9300000  3393191  2632035   243174

In [26]:
df2.drop('대구', axis = 1, inplace = True)
df2

           서울       부산       인천
2015  9900000  3448737  2890451
2010  9300000  3393191  2632035

In [28]:
df2.loc['2015', '서울' : '부산']

서울    9900000
부산    3448737
Name: 2015, dtype: int64

In [34]:
df['2005']= [9762546,3512547,2517680,2456016]
df.index = ['서울', '부산', '인천', '대구']
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016

In [36]:
df.loc['광주']=[1564813,1547812,1517680]
df

       2015     2010     2005
서울  9904312  9631482  9762546
부산  3448737  3393191  3512547
인천  2890451  2632035  2517680
대구  2466052  2431774  2456016
광주  1564813  1547812  1517680

In [38]:
df= df.sort_index()
df

       2015     2010     2005
광주  1564813  1547812  1517680
대구  2466052  2431774  2456016
부산  3448737  3393191  3512547
서울  9904312  9631482  9762546
인천  2890451  2632035  2517680

In [40]:
df.sort_values(by ='대구', axis =1, ascending = True)

       2010     2005     2015
광주  1547812  1517680  1564813
대구  2431774  2456016  2466052
부산  3393191  3512547  3448737
서울  9631482  9762546  9904312
인천  2632035  2517680  2890451

In [44]:
# 값의 갯수를 세어주는 함수 : value_counts()
import numpy as np
s = pd.Series(np.random.randint(0,6, size = 100))
s.value_counts()

0    19
1    18
5    18
2    15
3    15
4    15
dtype: int64